<!-- 
  这是一个简易的顶部导航栏组件，主要是在App页面上使用
  组件名称，HomeNavBar 
-->
<template>
  <div id="navbar">
    <router-link to="/">
      <img src="../../assets/YuandaStudio.png" alt="图标">
    </router-link>
    <ul>
      <li>
        <router-link to="/about">Me</router-link>
      </li>
      <li>
        <router-link to="/">博客</router-link>
      </li>
      <li>
        <router-link to="/favorite">收藏</router-link>
      </li>
      <li>
        <router-link to="/project">项目</router-link>
      </li>
      
      <li>
        <a href="https://github.com/xiaoyuanda">
          <svg t="1680352076195" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="16786" width="25" height="25"><path d="M511.64686793 127.35099585C293.32302442 127.26271264 116.4921875 304.00526636 116.49218749 522.15254418 116.4921875 694.65751442 227.11077881 841.29556689 381.16460277 895.14819335c20.74650367 5.20869653 17.56831567-9.53456322 17.56831644-19.59882496l-1e-8-68.4193198c-119.80002245 14.03699634-124.65558767-65.24113257-132.6893401-78.48358153C249.79950855 700.92560721 211.39640601 693.86296702 222.87319532 680.62051805c27.27944532-14.03699634 55.08858839 3.53132005 87.3118806 51.11585378 23.30671071 34.51865038 68.77245188 28.6919729 91.81431372 22.95357862 5.03213087-20.74650367 15.80265601-39.28593239 30.63419899-53.67606081-124.12588914-22.24731445-175.85972388-97.9941233-175.85972389-188.04277661 0-43.7000823 14.39012767-83.8688445 42.64068603-116.26870312-18.00973097-53.41121119 1.67737721-99.141802 4.32586671-105.93959252 51.29241943-4.59071557 104.6153474 36.72572533 108.76464844 39.99219654 29.13338819-7.85718679 62.41607666-12.00648705 99.67149974-12.00648782 37.43198952 0 70.80296119 4.3258667 100.20119825 12.27133668 9.97597853-7.59233714 59.4144551-43.08210134 107.08727202-38.75623462 2.56020703 6.79779052 21.80589915 51.46898508 4.85556442 104.17393286 28.60368967 32.48814186 43.17038377 73.01003616 43.17038378 116.79840088 0 90.22521974-52.08696605 166.06031179-176.56598729 187.95449416a112.5608174 112.5608174 0 0 1 33.63582056 80.33752441l0 99.31836767c0.70626417 7.94546923 0 15.80265602 13.24244897 15.80265601 156.34918212-52.70494701 268.90999952-200.40239573 268.90999951-374.40817677 0-218.23556103-176.91911936-394.88983153-395.06639798-394.88983154z" p-id="16787"></path></svg>
      </a>
      </li>
      
    </ul>
  </div>
</template>

<script>
export default {
  name: 'HomeNavBar',
  data() {
    return {
      msg: '这是页面导航栏'
    }
  }
  
}
</script>

<style scoped>
#navbar {
  overflow: hidden;
  height: 50px;
  padding: 20px 10px;
  display: flex;
  justify-content: space-between;
  align-items: center;
  max-width: 820px;
  margin: auto;
}
#navbar img {
  height: 40px;
  width: 80px;
  padding: 0;
  margin: 0;
  /* background-color: #354e9a; */
  border-radius: 5px;
}

#navbar img:hover{
  border-radius: 5px;
}
ul li a {
  display: block;
  height: 40px;
  width: 50px;
  line-height: 40px;
  color: #333;
  text-decoration: none;
}
#navbar a:hover{
  border-radius: 5px;
  background-color: #eee;
}
ul {
  display: flex;
  justify-content: space-between;
  padding: 0;
}
svg {
  margin-top: 7px;
}
</style>